Обработки/DataProcessors/_ОповещениеОНевыполненномПереводеДСФЛНаБиржу.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>_ОповещениеОНевыполненномПереводеДСФЛНаБиржу</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительныеСвойства</Name>
					<Comment>Служебное поле, не использовать для работы</Comment>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Обработки/DataProcessors/_ОповещениеОНевыполненномПереводеДСФЛНаБиржу/_ОповещениеОНевыполненномПереводеДСФЛНаБиржу/Ext/ObjectModule.bsl
// Интерфейс для регистрации обработки. Вызывается при добавлении обработки в справочник "ВнешниеОбработки"
//
// Возвращаемое значение (Структура):
//     Вид (Строка) - вид подключаемого объекта:
//         |- "ДополнительнаяОбработка"
//         |- "ДополнительныйОтчет"
//         |- "ЗаполнениеОбъекта"
//         |- "ПечатнаяФорма"
//
//     Назначение (массив строк) - имена объектов метаданных в формате <ИмяКлассаОбъектаМетаданного>.[*|<ИмяОбъектаМетаданных>]
//         Например, "Документ.СчетЗаказ" или "Справочник.*"
//
//     Наименование (строка) - краткая строка для идентификации обработки администратором (должна быть уникальна в пределах вида)
//
//     Версия (строка) - версия обработки в формате <старший номер>.<младший номер> (например "10.37")
//
//     Информация (Строка) - описание обработки
//
//     Команды (ТаблицаЗначений) - команды, поставляемые обработкой; одна строка таблицы соотвествует одной команде; колонки:
//         |- Представление (строка) - представление команды конечному пользователю
//         |- Идентификатор (строка) - идентификатор команды
//         |- Использование (строка) - варианты запуска обработки:
//         |      |- "ОткрытиеФормы"          - открыть форму обработки
//         |      |- "ВызовКлиентскогоМетода" - вызов клиентского экспортного метода из формы обработки
//         |      |- "ВызовСерверногоМетода"  - вызов серверного экспортного метода из модуля объекта обработки
//    	   |- ПоказыватьОповещение (Булево) - если Истина, требуется оказывать оповещение при начале и при окончании запуска обработки
//         |      Прим. Имеет смысл только при запуске обработки без открытия формы.
//	       |- Модификатор (Cтрока) - для печатных форм MXL, которые требуется отображать в форме ПечатьДокументов подсистемы
//                Печать требуется установить как "ПечатьMXL"
//
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительнаяОбработка,
		"Оповещение о невыполненном переводе ДС ФЛ на биржу",
		"0.13",
		"",
		Истина);
		
	// команды
	Команды = РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд();
	РаботаСДополнительнымиОтчетамиИОбработками.ДобавитьНовуюКомандуВТаблицу(Команды, "ОповещениеОНевыполненномПереводеДСФЛНаБиржуРЭМ", "Оповещение о невыполненном переводе ДС ФЛ на биржу (РЭМ)",,  Ложь, "ВызовСерверногоМетода");
	РегистрационныеДанные.Вставить("Команды", Команды);
	
	Возврат РегистрационныеДанные;
	
КонецФункции

// Интерфейс для запуска загрузки по регламентному заданию
//
// Параметры:
//     ИдентификаторКоманды (строка)  - идентификатор команды
//     ПараметрыОбработки (структура) - структура со свойством ДополнительнаяОбработкаСсылка (ссылка на
//        элемент справочника ДополнительныеОтчетыИОбработки, который связан с данной дополнительной обработкой)
//
Процедура ВыполнитьКоманду(ИдентификаторКоманды, ПараметрыОбработки) Экспорт
	
	// заполним параметры команды (вариативности команд здесь нет)
	ПараметрыКоманды = РаботаСДополнительнымиОтчетамиИОбработками.ПолучитьПараметрыКоманды(ПараметрыОбработки.ДополнительнаяОбработкаСсылка, ИдентификаторКоманды);
	
	Если Найти(ИдентификаторКоманды, "ОповещениеОНевыполненномПереводеДСФЛНаБиржу") = 1  Тогда
		
		ПараметрыСессии = ЗарегистрироватьНовуюСессию(ИдентификаторКоманды);
		
		Период = НачалоДня(ТекущаяДата());
		
		Если Справочники.Календари.ЭтоРабочийДень(Справочники.Календари.Общероссийский, Период) Тогда
			
			Организация	= ПараметрыКоманды.Организация;
			Получатели	= ПараметрыКоманды.Получатели;
			
			ВыполнитьОповещение(Получатели, ПараметрыСессии);
			
		КонецЕсли;
		
		ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
		
	КонецЕсли;
	
КонецПроцедуры // ВыполнитьКоманду

Процедура ЗарегистрироватьОшибку(ТекстОшибки, ПараметрыСессии = Неопределено)
	
	Если Не ЭтотОбъект.ДополнительныеСвойства.Свойство("Ошибки") Тогда
		ЭтотОбъект.ДополнительныеСвойства.Вставить("Ошибки", Новый Массив());
	КонецЕсли;
	
	Если ЭтотОбъект.ДополнительныеСвойства.Ошибки.Найти(ТекстОшибки)=Неопределено Тогда
		ЭтотОбъект.ДополнительныеСвойства.Ошибки.Добавить(ТекстОшибки);
	КонецЕсли;
	
	ДополнитьПараметрыВыполненияСессии(ПараметрыСессии, ТекстОшибки);
	
КонецПроцедуры // ЗарегистрироватьОшибку

Процедура ОповеститьОбОшибках(ЕстьОшибки = Неопределено)
	
	ЕстьОшибки = ЭтотОбъект.ДополнительныеСвойства.Свойство("Ошибки");
	
	Если Не ЕстьОшибки Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтотОбъект.ДополнительныеСвойства.Свойство("Источник") Тогда
		РаботаСРегламентнымиЗаданиями.ЗарегистрироватьОшибку(ЭтотОбъект.ДополнительныеСвойства.Ошибки, ЭтотОбъект.ДополнительныеСвойства.Источник);
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			РаботаСоСтрокамиКлиентСервер.ПолучитьСтрокуИзМассиваПодстрок(ЭтотОбъект.ДополнительныеСвойства.Ошибки, Символы.ПС));
	КонецЕсли;
	
КонецПроцедуры // ОповеститьОбОшибках

Процедура ОтправитьПисьмо(Содержание, Получатели, Тема, УчетнаяЗапись, ПараметрыСессии = Неопределено)
	
	Если Содержание = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла("htm");
	
	Попытка
		Содержание.Записать(ИмяВременногоФайла, ТипФайлаТабличногоДокумента.HTML);
		ТелоПисьма = Новый ТекстовыйДокумент;
		ТелоПисьма.Прочитать(ИмяВременногоФайла);
	Исключение
		
		ЗарегистрироватьОшибку("Не удалось сформировать сообщение из-за ошибки:" + Символы.ПС + ОписаниеОшибки(), ПараметрыСессии);
		
		Возврат;
		
	КонецПопытки;
	
	ПараметрыПисьма = Новый Структура("Кому, Тема, Тело, ТипТекста", Получатели, Тема, ТелоПисьма.ПолучитьТекст(), ТипТекстаПочтовогоСообщения.HTML);
	
	РаботаСЭлектроннойПочтой.ОтправитьЭлектронноеПисьмо(УчетнаяЗапись, ПараметрыПисьма);
	
КонецПроцедуры

Процедура ВыполнитьОповещение(Получатели, ПараметрыСессии = Неопределено) Экспорт
	
	ОповещениеОНевыполненномПереводе = Неопределено;
	
	ЗаполнитьОповещение(ОповещениеОНевыполненномПереводе);
	
	УчетнаяЗапись = РаботаСЭлектроннойПочтой.ПолучитьСистемнуюУчетнуюЗапись();
	
	Если ОповещениеОНевыполненномПереводе <> Неопределено Тогда
		ОтправитьПисьмо(ОповещениеОНевыполненномПереводе, Получатели, "Оповещение о невыполненном переводе ДС ФЛ на биржу", УчетнаяЗапись, ПараметрыСессии);
	КонецЕсли;
	
	ОповеститьОбОшибках();
	
КонецПроцедуры	

Процедура ЗаполнитьОповещение(ОповещениеОНевыполненномПереводе, ЗаполнятьВСлучаеОтсутствия = Ложь) Экспорт
	
	Запрос = Новый Запрос;	
	Запрос.Текст = 
#Область ТекстЗапроса
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	МестаХранения.Ссылка КАК МестоХранения
		|ПОМЕСТИТЬ _ВнебиржевыеМестаХранения
		|ИЗ
		|	Справочник.МестаХранения КАК МестаХранения
		|ГДЕ
		|	МестаХранения.Ссылка В ИЕРАРХИИ (ЗНАЧЕНИЕ(Справочник.МестаХранения.ВнебиржевойРынок))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СчетаДоверительногоУправления.Ссылка КАК СчетДУ
		|ПОМЕСТИТЬ _СчетаДУ
		|ИЗ
		|	Справочник.СчетаДоверительногоУправления КАК СчетаДоверительногоУправления
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтратегииИндивидуальногоИнвестирования.СрезПоследних(&Период, Организация = &Организация) КАК СтратегииИндивидуальногоИнвестированияСрезПоследних
		|		ПО СчетаДоверительногоУправления.Ссылка = СтратегииИндивидуальногоИнвестированияСрезПоследних.СчетДоверительногоУправления
		|ГДЕ
		|	СчетаДоверительногоУправления.Организация = &Организация
		|	И (СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.ИндивидуальныйИнвестиционныйСчет)
		|			ИЛИ СтратегииИндивидуальногоИнвестированияСрезПоследних.Стратегия.Стандартная)
		|	И СчетаДоверительногоУправления.ДатаЗаключения <= &Период
		|	И (СчетаДоверительногоУправления.ДатаРасторжения = ДАТАВРЕМЯ(1, 1, 1)
		|			ИЛИ СчетаДоверительногоУправления.ДатаРасторжения >= &Период)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_СчетаДУ.СчетДУ КАК СчетДУ,
		|	ЕСТЬNULL(ФинансовыеПоказателиСрезПоследних.Значение, 0) КАК СЧА
		|ПОМЕСТИТЬ _СЧА
		|ИЗ
		|	_СчетаДУ КАК _СчетаДУ
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФинансовыеПоказатели.СрезПоследних(
		|				&Период,
		|				Организация = &Организация
		|					И ВидПоказателя = ЗНАЧЕНИЕ(Справочник.ВидыФинансовыхПоказателей.СтоимостьЧистыхАктивов_Рынок)
		|					И СубъектАналитики В
		|						(ВЫБРАТЬ
		|							_СчетаДУ.СчетДУ КАК СчетДУ
		|						ИЗ
		|							_СчетаДУ КАК _СчетаДУ)) КАК ФинансовыеПоказателиСрезПоследних
		|		ПО _СчетаДУ.СчетДУ = ФинансовыеПоказателиСрезПоследних.СубъектАналитики
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОстаткиДенежныхСредствОстатки.СчетДоверительногоУправления КАК СчетДУ,
		|	СУММА(ОстаткиДенежныхСредствОстатки.СуммаОстаток) КАК Остаток
		|ПОМЕСТИТЬ _ОстаткиДС
		|ИЗ
		|	РегистрНакопления.ОстаткиДенежныхСредств.Остатки(
		|			&Период,
		|			Организация = &Организация
		|				И МестоХранения В
		|					(ВЫБРАТЬ
		|						_ВнебиржевыеМестаХранения.МестоХранения КАК МестоХранения
		|					ИЗ
		|						_ВнебиржевыеМестаХранения КАК _ВнебиржевыеМестаХранения)
		|				И Брокер = ЗНАЧЕНИЕ(Справочник.БрокерскиеКомпании.ПустаяСсылка)
		|				И СчетДоверительногоУправления В
		|					(ВЫБРАТЬ
		|						_СчетаДУ.СчетДУ КАК СчетДУ
		|					ИЗ
		|						_СчетаДУ КАК _СчетаДУ)) КАК ОстаткиДенежныхСредствОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ОстаткиДенежныхСредствОстатки.СчетДоверительногоУправления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ОстаткиДС.СчетДУ КАК СчетДУ,
		|	_ОстаткиДС.Остаток КАК Остаток
		|ПОМЕСТИТЬ _СчетаДУКПроверке
		|ИЗ
		|	_ОстаткиДС КАК _ОстаткиДС
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _СЧА КАК _СЧА
		|		ПО _ОстаткиДС.СчетДУ = _СЧА.СчетДУ
		|ГДЕ
		|	ВЫБОР
		|			КОГДА _СЧА.СЧА = 0
		|				ТОГДА _ОстаткиДС.Остаток > 0
		|			ИНАЧЕ _ОстаткиДС.Остаток / _СЧА.СЧА >= 0.03
		|		КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_СчетаДУКПроверке.СчетДУ КАК СчетДУ,
		|	_СчетаДУКПроверке.Остаток КАК Остаток
		|ИЗ
		|	_СчетаДУКПроверке КАК _СчетаДУКПроверке
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОстаткиДенежныхСредствОстаткиИОбороты.СчетДоверительногоУправления КАК СчетДУ,
		|	ОстаткиДенежныхСредствОстаткиИОбороты.Регистратор КАК Документ,
		|	ОстаткиДенежныхСредствОстаткиИОбороты.Период КАК Период,
		|	СУММА(ОстаткиДенежныхСредствОстаткиИОбороты.СуммаНачальныйОстаток) КАК НачальныйОстаток,
		|	СУММА(ОстаткиДенежныхСредствОстаткиИОбороты.СуммаПриход - ОстаткиДенежныхСредствОстаткиИОбороты.СуммаРасход) КАК Сумма,
		|	СУММА(ОстаткиДенежныхСредствОстаткиИОбороты.СуммаКонечныйОстаток) КАК КонечныйОстаток
		|ИЗ
		|	РегистрНакопления.ОстаткиДенежныхСредств.ОстаткиИОбороты(
		|			,
		|			&Период,
		|			Регистратор,
		|			Движения,
		|			Организация = &Организация
		|				И МестоХранения В
		|					(ВЫБРАТЬ
		|						_ВнебиржевыеМестаХранения.МестоХранения КАК МестоХранения
		|					ИЗ
		|						_ВнебиржевыеМестаХранения КАК _ВнебиржевыеМестаХранения)
		|				И Брокер = ЗНАЧЕНИЕ(Справочник.БрокерскиеКомпании.ПустаяСсылка)
		|				И СчетДоверительногоУправления В
		|					(ВЫБРАТЬ
		|						_СчетаДУКПроверке.СчетДУ КАК СчетДУ
		|					ИЗ
		|						_СчетаДУКПроверке КАК _СчетаДУКПроверке)) КАК ОстаткиДенежныхСредствОстаткиИОбороты
		|
		|СГРУППИРОВАТЬ ПО
		|	ОстаткиДенежныхСредствОстаткиИОбороты.Регистратор,
		|	ОстаткиДенежныхСредствОстаткиИОбороты.СчетДоверительногоУправления,
		|	ОстаткиДенежныхСредствОстаткиИОбороты.Период
		|
		|УПОРЯДОЧИТЬ ПО
		|	СчетДУ,
		|	Период УБЫВ";
#КонецОбласти
	
	Запрос.УстановитьПараметр("Организация",	Организация);
	Запрос.УстановитьПараметр("Период",			Период);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	Остатки = РезультатЗапроса[5].Выгрузить();
	Обороты = РезультатЗапроса[6].Выгрузить();
	
	ДанныеКОповещению = Новый ТаблицаЗначений;
	ДанныеКОповещению.Колонки.Добавить("СчетДУ",	Новый ОписаниеТипов("СправочникСсылка.СчетаДоверительногоУправления"));
	ДанныеКОповещению.Колонки.Добавить("Документ",	Новый ОписаниеТипов("ДокументСсылка.ВводДенежныхСредств"));
	
	ГраницаДляОповещения = Справочники.Календари.ДобавитьКДатеРабочиеДни(Справочники.Календари.Общероссийский, НачалоДня(Период), -3);
	
	// Обходим проверяемые СчетаДУ
	Для Каждого ТекОстаток Из Остатки Цикл
		
		СчетДУ	= ТекОстаток.СчетДУ;
		Остаток	= ТекОстаток.Остаток;
		
		НайденныеСтроки = Обороты.НайтиСтроки(Новый Структура("СчетДУ", СчетДУ));
		
		ВводыДС = Новый Массив;
		
		// Формируем список вводов ДС, которые участвовали в формировании текущего остатка, с момента которых прошло больше 2 р.д.
		Для Каждого ТекСтрока Из НайденныеСтроки Цикл
			
			Если ТекСтрока.Сумма > 0 Тогда
				
				Если ТипЗнч(ТекСтрока.Документ) = Тип("ДокументСсылка.ВводДенежныхСредств")
					И ТекСтрока.Период < ГраницаДляОповещения Тогда
						
					ВводДС = Новый Структура;
					ВводДС.Вставить("Документ",			ТекСтрока.Документ);
					ВводДС.Вставить("Дата",				ТекСтрока.Период);
					ВводДС.Вставить("НачальныйОстаток",	ТекСтрока.НачальныйОстаток);
					ВводДС.Вставить("Сумма",			ТекСтрока.Сумма);
					
					ВводыДС.Вставить(0, ВводДС);
					
				КонецЕсли;
				
				Остаток = Остаток - ТекСтрока.Сумма;
				
				Если Остаток <= 0 Тогда
					Прервать;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
		// Если таковых нет, переходим к следующему СчетуДУ.
		Если ВводыДС.Количество() = 0 Тогда
			Продолжить;
		Иначе
			ПервыйВводДС = ВводыДС[0].Документ;
		КонецЕсли;
		
		// Определяем переводы ДС, которые были выполнены после первого ввода ДС, участвующего в формировании текущего остатка.
		ПереводыДС = Новый Массив;
		
		Для Каждого ТекСтрока Из НайденныеСтроки Цикл
			
			Если ТекСтрока.Документ = ПервыйВводДС Тогда
				Прервать;
			КонецЕсли;
			
			Если ТипЗнч(ТекСтрока.Документ) = Тип("ДокументСсылка.ПереводДенежныхСредств")
				И ТекСтрока.Сумма < 0 Тогда
				
				ПереводДС = Новый Структура;
				ПереводДС.Вставить("Документ",	ТекСтрока.Документ);
				ПереводДС.Вставить("Сумма",		-1*ТекСтрока.Сумма);
				
				ПереводыДС.Вставить(0, ПереводДС);
				
			КонецЕсли;
			
		КонецЦикла;
		
		ВводыНеПерекрыты = Ложь;
		
		// Определяем по каким вводам ДС суммы не перекрыты переводами.
		Для Каждого Ввод Из ВводыДС Цикл
			
			Остаток = Ввод.Сумма;
			
			// Если не перекрыт один ввод, то не перекрыты и остальные.
			Если НЕ ВводыНеПерекрыты Тогда
				
				Для Каждого Перевод Из ПереводыДС Цикл
					
					// Этот перевод уже использовали.
					Если Перевод.Сумма = 0 Тогда
						Продолжить;
					КонецЕсли;
					
					// Проверяем, хватает ли суммы перевода на перекрытие ввода.
					Если Перевод.Сумма < Остаток Тогда
						Остаток = Остаток - Перевод.Сумма;
						Перевод.Сумма = 0;
					Иначе
						Остаток = 0;
						Перевод.Сумма = Перевод.Сумма - Остаток;
					КонецЕсли;
					
					// Если ввод перекрыт, прерываем обход переводов.
					Если Остаток = 0
						ИЛИ Остаток / Ввод.Сумма <= 0.03 Тогда
						Прервать;
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЕсли;
			
			// Если ввод не перекрыт, добавляем в список к оповещению.
			Если Остаток <> 0
				И Остаток / Ввод.Сумма > 0.03 Тогда
				
				ВводыНеПерекрыты = Истина;
				
				НоваяСтрока				= ДанныеКОповещению.Добавить();
				НоваяСтрока.СчетДУ		= СчетДУ;
				НоваяСтрока.Документ	= Ввод.Документ;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Если ЗаполнятьВСлучаеОтсутствия
		ИЛИ ДанныеКОповещению.Количество() > 0 Тогда
		СформироватьПисьмо(ОповещениеОНевыполненномПереводе, ДанныеКОповещению);
	КонецЕсли;
	
КонецПроцедуры

Процедура СформироватьПисьмо(Письмо, ДанныеКОповещению)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Период",				Период);
	Запрос.УстановитьПараметр("Организация",		Организация);
	Запрос.УстановитьПараметр("ДанныеКОповещению",	ДанныеКОповещению);
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДанныеКОповещению.СчетДУ КАК СчетДУ,
		|	ДанныеКОповещению.Документ КАК Документ
		|ПОМЕСТИТЬ _ДанныеКОповещению
		|ИЗ
		|	&ДанныеКОповещению КАК ДанныеКОповещению
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ДанныеКОповещению.СчетДУ КАК СчетДУ,
		|	РеквизитыФизическихЛицСрезПоследних.Фамилия + "" "" + РеквизитыФизическихЛицСрезПоследних.Имя + "" "" + РеквизитыФизическихЛицСрезПоследних.Отчество КАК ФИО,
		|	КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления.НомерДоговора КАК НомерДоговора,
		|	КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления.ДатаЗаключения КАК ДатаДоговора,
		|	_ДанныеКОповещению.Документ КАК Документ,
		|	_ДанныеКОповещению.Документ.Сумма КАК Сумма
		|ИЗ
		|	_ДанныеКОповещению КАК _ДанныеКОповещению
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(
		|				&Период,
		|				СчетДоверительногоУправления В
		|					(ВЫБРАТЬ
		|						_ДанныеКОповещению.СчетДУ КАК СчетДУ
		|					ИЗ
		|						_ДанныеКОповещению КАК _ДанныеКОповещению)) КАК КлиентыДоверительногоУправленияСрезПоследних
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыФизическихЛицАнкетные.СрезПоследних(
		|					&Период,
		|					Организация = &Организация
		|						И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыФизическихЛицСрезПоследних
		|			ПО КлиентыДоверительногоУправленияСрезПоследних.Клиент = РеквизитыФизическихЛицСрезПоследних.ЮрФизЛицо
		|		ПО _ДанныеКОповещению.СчетДУ = КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления
		|ИТОГИ
		|	МАКСИМУМ(ФИО),
		|	МАКСИМУМ(НомерДоговора),
		|	МАКСИМУМ(ДатаДоговора),
		|	СУММА(Сумма)
		|ПО
		|	СчетДУ";
	
	ВыборкаСчетовДУ = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Письмо = Новый ТабличныйДокумент;
	
	Макет = ПолучитьМакет("Макет");
	
	Письмо.Вывести(Макет.ПолучитьОбласть("Заголовок"));
	
	ОбластьСчетДУ	= Макет.ПолучитьОбласть("СчетДУ");
	ОбластьДокумент	= Макет.ПолучитьОбласть("Документ");
	
	Пока ВыборкаСчетовДУ.Следующий() Цикл
		
		Выборка = ВыборкаСчетовДУ.Выбрать();
		
		ОбластьСчетДУ.Параметры.Заполнить(ВыборкаСчетовДУ);
		ОбластьСчетДУ.Параметры.ДатаДоговора = Формат(ВыборкаСчетовДУ.ДатаДоговора, "ДЛФ=D");
		
		Письмо.Вывести(ОбластьСчетДУ);
		
		Пока Выборка.Следующий() Цикл
			
			ОбластьДокумент.Параметры.Заполнить(Выборка);
			
			Письмо.Вывести(ОбластьДокумент);
			
		КонецЦикла;
		
	КонецЦикла;
	
	Письмо.Вывести(Макет.ПолучитьОбласть("Подвал"));
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////

#Область СтатистикаРаботыВнутреннихМеханизмов

Процедура ДополнитьПараметрыВыполненияСессии(ПараметрыСессии, ТекстОшибки) Экспорт
	
	Если ПараметрыСессии = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ДополнитьПараметрыВыполненияСессии(
		ПараметрыСессии.Механизм, ПараметрыСессии.Сессия, Новый Структура("ТекстОшибки", ТекстОшибки));
	
КонецПроцедуры

Функция ЗарегистрироватьНовуюСессию(ИмяКоманды) Экспорт
	Возврат РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессиюОбъекта(ЭтотОбъект, ИмяКоманды);
КонецФункции

Процедура ЗарегистрироватьОкончаниеСессии(ПараметрыСессии) Экспорт
	
	Если ПараметрыСессии = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(ПараметрыСессии.Механизм, ПараметрыСессии.Сессия);
	
КонецПроцедуры

#КонецОбласти

ЭтотОбъект.ДополнительныеСвойства = Новый Структура;
